# coding=UTF-8
import datetime


def tool_data_format():
    """
    对数据进行格式化，目前只接受由dict类型组成的list的数据
    :param data: 一个或多个dict组成的list
    :return: 格式化后的数据
    """
    today = datetime.datetime.now().strftime('%Y-%m-%d') + ':\n'
    print(today)
    data = [{'dealdate': '2018-02-26', 'tasktype': '2018年第一季度', 'dealer_name': '黄志江', 'info': '集成Daqosft认证中心到整合平台\x01规划中\x012018-02-26 17:32\x01zuul请求路由调用前的验证，通过token使用授权中心来验证token用户并放入进zuul的上下文关系供后面的路由调用。'}, {'dealdate': '2018-02-26', 'tasktype': '数据平台', 'dealer_name': '王学艳', 'info': '整合从政务网收集的景区数据和酒店数据\x01实现中\x012018-02-26 17:11\x012018-02-261.整理之前已交出的数据（乌鲁木齐数据），数据整合后入库2.北京，天津，河北的政务网数据和抓取数据匹配后入库（以政务网数据为主资源）'}, {'dealdate': '2018-02-26', 'tasktype': '脚本开发', 'dealer_name': '谢洋杰', 'info': 'TAPD 迭代更新\x01实现中\x012018-02-26 17:48\x01迭代开发：> 进度：1. TAPD脚本迭代开发————进行中- 新增项目目录抓取功能- 新增抓取和解析的方法- 新增数据结果格式化功能> 总结：- TAPD脚本迭代中，目前正在研究数据结果格式化的最优方法'}, {'dealdate': '2018-02-26', 'tasktype': '脚本开发', 'dealer_name': '谢洋杰', 'info': 'TAPD 迭代更新\x01实现中\x012018-02-26 17:47\x01新增需求调研：-任务需求：1. 原tapd脚本迭代开发- 新增项目目录，原脚本只有实验室事项目录- 当日任务数据按照每个人为单位划分，需要将数据进行二次处理（格式化）- 数据字段：1. 原字段- 迭代调整思路：- 遍历项目目录，将原来固定一个目录改为变成多个目录- 输出结果由原来以任务为单位输出变为以人为单位输出，将每个人每天的任务内容放在一块输出到文本'}, {'dealdate': '2018-02-26', 'tasktype': '平台开发', 'dealer_name': '胡明伟', 'info': '"中国日报"新闻脚本开发\x01实现中\x012018-02-26 09:54\x012018-2-26今日计划：调研中国日报网，初步制定爬取策略完成情况：1、中国日报网，分为多语言，只抓取“中文”版本对应的新闻过滤掉包含有“/usa.chinadaily.com.cn/”、“/europe.chinadaily.com.cn/”、“/africa.chinadaily.com.cn/”、“/www.chinadailyasia.com/”、“/www.chinadaily.com.cn/chinawatch_fr/”、“/bbs.chinadaily.com.cn/”其中之一的url；过滤掉包含“/cartoon.chinadaily.com.cn/”（中国新闻漫画网）、“/language.chinadaily.com.cn/”（双语）、“/kan.chinadaily.com.cn/”（视频-其中一种）的url2、全量爬取新闻列表及具体新闻：列表：除具体新闻外的url，用来爬取新闻列表+具体新闻也爬取相关新闻列表(会造成额外消耗，但新闻应该会更多）具体新闻：以“/[\\d-]+/[\\d]+/.*[\\d]+\\.[s]?htm[l]?$”结尾注意：新闻列表及具体新闻url，都需要拼接；'},{'dealdate': '2018-02-26', 'tasktype': '平台开发', 'dealer_name': '王家葳', 'info': 'request_model模块开发\x01实现中\x012018-02-26 09:09\x01今日计划：完成预期API的开发今日进度:开发各模块子功能'}, {'dealdate': '2018-02-26', 'tasktype': '工程化', 'dealer_name': '黄欣凯', 'info': '旅游舆情分析平台语法分析\x01规划中\x012018-02-26 18:03\x01语素分析1、分局分词（进行中）2、进行语素分析3、进行形容词判断（如果句子中没有行如此就不在执行）4、提取形容词，然后根据形容词的顺序进行语句拼接'}, {'dealdate': '2018-02-26', 'tasktype': '临时任务', 'dealer_name': '刘敏', 'info': 'Python机器学习入门\x01规划中\x012018-02-26 18:06\x012018-02-26今日计划1、上午：攥写观点提取结论的文档2、下午：学习机器学习的相关的视频执行进度1、上午：攥写观点提取结论的文档（1）完成了“依存关系选择”的部分（2）把相关文档上传TAPD中2、下午：学习机器学习的相关的视频（1）第1课：机器学习与微积分（2）第5课：线性回归与逻辑回归'}, {'dealdate': '2018-02-26', 'tasktype': 'oozie流程开发', 'dealer_name': '龙超国', 'info': '舆情分析系统流程设计\x01实现中\x012018-02-26 16:49\x01今日任务：舆情分析--高频词分析流程设计，开发，调试，上线完成进度已完成 舆情分析--高频词分析流程设计，开发，调试，上线'}, {'dealdate': '2018-02-26', 'tasktype': 'oozie流程开发', 'dealer_name': '龙超国', 'info': '舆情事件分析系统流程设计\x01实现中\x012018-02-26 10:52\x01今日任务：舆情事件分析数据流向及数据格式整理完成进度：已完成'}, {'dealdate': '2018-02-26', 'tasktype': '数据爬取', 'dealer_name': '胡明伟', 'info': '驴妈妈景区信息及评论增量更新\x01实现中\x012018-02-26 09:02\x012018-02-26列表总数：12637列表增量：3评论增量：2021（2018-02-25）、1722（2018-02-26）'}, {'dealdate': '2018-02-26', 'tasktype': '数据爬取', 'dealer_name': '王家葳', 'info': '同程网 景区评论增量抓取\x01实现中\x012018-02-26 15:10\x012018/02/25评论量：788评论总量：1186439'}, {'dealdate': '2018-02-26', 'tasktype': '数据爬取', 'dealer_name': '胡明伟', 'info': '携程 景区评论增量爬取\x01实现中\x012018-02-26 09:03\x012018-02-26列表总数：15811列表增量：15评论增量：11283（2018-02-25）、9740（2018-02-26）'}, {'dealdate': '2018-02-26', 'tasktype': '数据爬取', 'dealer_name': '胡明伟', 'info': '蚂蜂窝景区评论数据增量抓取\x01实现中\x012018-02-26 09:03\x012018-02-26列表总数：38083列表增量：0评论增量：919（2018-02-25）、650（2018-02-26）'}, {'dealdate': '2018-02-26', 'tasktype': '数据爬取', 'dealer_name': '王家葳', 'info': '途牛网景区评论增量数据抓取\x01实现中\x012018-02-26 15:06\x012018/02/25新增景区量：3571新增景区：0评论量：31评论总量： 15177'}, {'dealdate': '2018-02-26', 'tasktype': '数据爬取', 'dealer_name': '王家葳', 'info': '去哪儿网景区评论增量数据抓取\x01实现中\x012018-02-26 15:08\x012018/02/25景区量： 52914新增景区量：10评论量：1533评论总量：6470704'}, {'dealdate': '2018-02-26', 'tasktype': '数据爬取', 'dealer_name': '胡明伟', 'info': "新浪微舆情全文搜索列表及详情数据爬取\x01实现中\x012018-02-26 09:05\x012018-02-26('雅安','罗浮山+绵阳')新增列表：2563（2018-02-25）、2183（2018-02-26）新增详情：2499（2018-02-25）、2243（2018-02-26）('乌鲁木齐', '丽江',)新增列表：8106（2018-02-25）、8199（2018-02-26）新增详情：1104（2018-02-25）、1108（2018-02-26）('吐鲁番', '新疆+和田', '克拉玛依')新增列表：3301（2018-02-25）、2932（2018-02-26）新增详情：1086（2018-02-25）、1095（2018-02-26）('克孜勒苏柯尔克孜', '博尔塔拉', '哈密地区', '阿勒泰', '昌吉', '塔城')新增列表：4294（2018-02-25）、4422（2018-02-26）新增详情：1118（2018-02-25）、1104（2018-02-26）('喀什+新疆', '伊犁+新疆', '巴音+新疆', '阿克苏+新疆', '智慧旅游+乌鲁木齐)新增列表：3643（2018-02-25）、3834（2018-02-26）新增详情：4092（2018-02-25）、4109（2018-02-26）('玉溪', '德宏', '保定', '昆明' )新增列表：7606（2018-02-25）、7165（2018-02-26）新增详情：1100（2018-02-25）、1087（2018-02-26）"}, {'dealdate': '2018-02-26', 'tasktype': '数据爬取', 'dealer_name': '胡明伟', 'info': '新浪微舆情信息监测列表详情内容抓取\x01实现中\x012018-02-26 09:04\x012018-02-26‘旅游’：新增列表：11095（2018-02-25）、11349（2018-02-26）新增详情：10670（2018-02-25）、10739（2018-02-26）‘旅游，西安’，‘旅游，陕西’列表新增：0新增详情：0(石林+(云南|昆明))|(世博园+(云南|昆明))|(腾冲火山+(云南|保山))|(丽江+古城)列表新增：2143（2018-02-25）、1959（2018-02-26）新增详情：5217（2018-02-25）、5347（2018-02-26）(玉龙雪山+(云南|丽江))|(西双版纳+热带植物园)|(崇圣寺三塔文化+(云南|大理))|(普达措+国家公园+(云南|迪庆|香格里拉))|(天山+大峡谷+(新疆|乌鲁木齐))|(兴文石海)|(河北+承德)列表新增：1350（2018-02-25）、1967（2018-02-26）新增详情：4568（2018-02-25）、1965（2018-02-26）'}]
    all_name = set([])
    for each in data:
        all_name.add(each.get('dealer_name'))

    for one in all_name:
        save_data = ''
        onelist = []
        for each in data:
            if each.get('dealer_name') == one:
                onelist.append(each)

        typename = set([])
        for eveyone in onelist:
            tasktype = eveyone.get('tasktype')
            typename.add(tasktype)
        save_data += one.strip() + ':' + '\n'
        for eachtype in typename:
            typelist = []
            for eveyone in onelist:
                if eveyone.get('tasktype') == eachtype:
                    typelist.append(eveyone.get('info'))
            save_data += eachtype.strip() + '\n'
            for each in typelist:
                save_data += '\t\t' + each.strip() + '\n'

        print(save_data)


if __name__ == '__main__':
    tool_data_format()
